Documents/ЗаказТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаказТовара</Name>
			<Comment>(удалить)</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;
	
	РежимЗаписиПроведение = Новый Структура ("РежимЗаписи", РежимЗаписиДокумента.Запись);
	
	Избранный = гоИзбранный(Объект.Ссылка);
	
	ЧислоЗнаковКоличество = Объект.Фирма.ЧислоЗнаковКоличество;
	ЧислоЗнаковЦенаЗакупки = Объект.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	Элементы.ТоварыКоличество.Формат = "ЧДЦ=" + ЧислоЗнаковКоличество;
	Элементы.ТоварыЦенаЗакупки.Формат = "ЧДЦ=" + ЧислоЗнаковЦенаЗакупки;
	Элементы.ТоварыНоменклатураРодитель.Видимость = Объект.Фирма.ВыводитьГруппа;
	Элементы.ТоварыНоменклатураПроизводитель.Видимость = Объект.Фирма.ВыводитьПроизводитель;
	
	Попытка
		Элементы.ФормаИзменитьФорму.Видимость = Ложь;
	Исключение
	КонецПопытки; 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ клФормаДокументаПередЗаписью(ЭтаФорма, Объект) Тогда Отказ = Истина КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
	МоиОстатки();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура МоиИтоги()
	стрИтого = "";
	стрОплата = "";
	омСервер.МоиИтоги(Объект, стрИтого, стрОплата);
КонецПроцедуры

&НаКлиенте
Процедура МоиОстатки()
	стрОстатки = "?";
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	стрОстатки = омСервер.МоиОстатки(Объект.Ссылка, Стр.Номенклатура, 0, , Истина);
КонецПроцедуры

&НаКлиенте
Процедура МояЗаписать(ПроверятьМодифицированность = Истина)
	УстановитьВидимостьДоступность();
	
	Если ПроверятьМодифицированность Тогда
		Если НЕ Модифицированность Тогда Возврат КонецЕсли; КонецЕсли; 
		
	Записать(РежимЗаписиПроведение);
	МоиОстатки();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	НетСтрок = Объект.Товары.Количество() = 0;
	ЕстьСтроки = НЕ НетСтрок;
	
	Закрыто = Объект.Окончательно;	
	НеЗакрыто = НЕ Закрыто;
	
	Элементы.Дата.ТолькоПросмотр = Закрыто;
	Элементы.Валюта.ТолькоПросмотр = ЕстьСтроки ИЛИ Закрыто;
	Элементы.Установить.Доступность = НеЗакрыто;
	Элементы.Снять.Доступность = Закрыто;
	Элементы.Контрагент.ТолькоПросмотр = Закрыто;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ клФормаДокументаПриОткрытии(ЭтаФорма, Объект) Тогда Отказ = Истина; Возврат; КонецЕсли; 
	
	ТолПро = ЭтаФорма.ТолькоПросмотр;
	
	//2016.08.26
	//этоЧужой = Ложь;
	//Если НЕ Объект.Ссылка.Пустая() Тогда 
	//	этоЧужой = гоЧужойДокумент(Объект.КемСоздан);
	//КонецЕсли; 
	
	//2016.08.26 + ИЛИ этоЧужой
	Если Избранный 
		//ИЛИ этоЧужой 
		Тогда ТолПро = Истина КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = ТолПро;
	
	стрПросмотр = клПросмотр(ЭтаФорма, Избранный, Объект.Ссылка);
	
	УстановитьВидимостьДоступность();
	МоиИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	МоиОстатки();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	МоеДобавление();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	МоеРедактирование(СтрЗаменить(Элемент.ТекущийЭлемент.Имя, "Товары", ""));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	МоеУдаление();
КонецПроцедуры

&НаКлиенте
Процедура МоеДобавление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Валюта) Тогда клОшибка("Не задана валюта!"); Возврат; КонецЕсли; 
	
	Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Попытка
		НовНом = Элементы.Товары.ТекущиеДанные.Номенклатура;
	Исключение 
		НовНом = гоПустой("Номенклатура");
	КонецПопытки;
	
	КонстантаНеВыходить = 1;	//пока все без настроек
	
	НеВыходить = Истина;
	Пока НеВыходить Цикл
		Если НЕ ВвестиЗначение(НовНом, "Выберите номенклатуру") Тогда Возврат КонецЕсли; 
		
		Нашли = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если НЕ (Нашли.Количество() = 0) Тогда клОшибка(гоИмя(НовНом) + ": уже есть в документе!" + гоРС() + "Нужно просто отредактировать количество!!!"); Возврат; КонецЕсли;
		
		НовЦен = 0;
			 
		Пар = Новый Структура;
		Пар.Вставить("Фирма", Объект.Фирма);
		Пар.Вставить("Номенклатура", НовНом);
		Пар.Вставить("Валюта", Объект.Валюта);
		Пар.Вставить("Поставщик", Объект.Контрагент);
		Пар.Вставить("Количество", 0);
		Пар.Вставить("Цена", НовЦен);
		
		НовПар = ОткрытьФормуМодально("ОбщаяФорма.ВводСтрокиЗТ", Пар);
		Если гоПЗ(НовПар) Тогда Продолжить КонецЕсли; 
		
		НовЦен = НовПар.Цена;
		НовКол = НовПар.Количество;
		Если НовКол = 0 Тогда клОшибка("Не введено количество!"); Продолжить; КонецЕсли;
		
		Если НЕ клСохранитьИзменения() Тогда Продолжить КонецЕсли; 
		
		НовСтр = Объект.Товары.Добавить();
		
		НовСтр.Номенклатура = НовНом;
		НовСтр.Количество = НовКол;
		НовСтр.ЦенаЗакупки = НовЦен;
		
		ИДИ = НовСтр.ПолучитьИдентификатор();
		
		МояЗаписать(Ложь);
		
		гоЗаписьЖурналаРегистрации(Строка(НовКол) + "|" + гоСуммаЗн(НовЦен, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
		
		Элементы.Товары.ТекущаяСтрока = ИДИ;
		
		НеВыходить = КонстантаНеВыходить;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МоеРедактирование(Кол)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	
	Если Кол = "ЦенаЗакупки" Тогда
		Цена = Стр[Кол];
		Было = Цена;
		Если НЕ ВвестиЧисло(Цена, НСтр("ru = 'Цена закупки'; en = 'Purchase price'"), 19, ЧислоЗнаковЦенаЗакупки) Тогда Возврат КонецЕсли; 
		Если Было = Цена Тогда Возврат КонецЕсли; 
		Стр[Кол] = Цена;
	ИначеЕсли Кол = "Количество" Тогда
		Колв = Стр.Количество;
		Было = Колв;
		Если НЕ ВвестиЧисло(Колв, НСтр("ru = 'Количество'; en = 'Quantity'"), 14, ЧислоЗнаковКоличество) Тогда Возврат КонецЕсли; 
		Если Было = Колв Тогда Возврат КонецЕсли; 
		Стр.Количество = Колв;
		
		Колич =	Колв;
		СЦена = Стр.ЦенаЗакупки;
		Номен =	Стр.Номенклатура;
		гоЗаписьЖурналаРегистрации(Строка(Было) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Объект.Ссылка, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Редактирование количества", Номен, 2);
		гоЗаписьЖурналаРегистрации(Строка(Было) + "->" + Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Редактирование количества", Объект.Ссылка, 2);
	КонецЕсли; 
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МоеУдаление()
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда 
		Если гоАдминистратор() Тогда 
			Сообщить("Под ответственность Администратора!");
		Иначе 
			Возврат;
		КонецЕсли; 
	КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	ИДИ = Элементы.Товары.ТекущаяСтрока;
	Стр = Элементы.Товары.ТекущиеДанные;
	Если Стр = Неопределено Тогда Возврат КонецЕсли; 
	
	Если клНетДа("Удалить строку?") Тогда Возврат КонецЕсли; 
	
	Номен = Стр.Номенклатура;
	СЦена = Стр.ЦенаЗакупки;
	Колич = Стр.Количество;
	
	Удаляем = Объект.Товары.НайтиПоИдентификатору(ИДИ);
	Если Удаляем = Неопределено Тогда клОшибка("Странно, не нашли текущую строку!"); Возврат; КонецЕсли; 
	
	Объект.Товары.Удалить(Удаляем);
	
	гоЗаписьЖурналаРегистрации(Строка(Колич) + "|" + гоСуммаЗн(СЦена, ЧислоЗнаковЦенаЗакупки) + "|" + гоИмя(Номен, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Удаление строки", Объект.Ссылка, 2);
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если Объект.Окончательно Тогда Возврат КонецЕсли;
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Товары.Количество() = 0 Тогда Возврат КонецЕсли;
	
	Если клНетДа(НСтр("ru = 'Установить флаг <Окончательно>?'; en = 'Set flag <Finaly>?'")) Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Истина;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Установили", ИмяДокумента, "Установка {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура Снять(Команда)
	Если НЕ Объект.Окончательно Тогда Возврат КонецЕсли; 
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если клНетДа("Снять флаг {Окончательно}?") Тогда Возврат КонецЕсли;
	
	Объект.Окончательно = Ложь;
	МояЗаписать(Ложь);
	
	гоЗаписьЖурналаРегистрации("Сняли", ИмяДокумента, "Снятие {Окончательно}", Объект.Ссылка, 2);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсе(Команда)
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если клНетДа("Удалить все строки?") Тогда Возврат КонецЕсли; 
	
	Объект.Товары.Очистить();
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЦены(Команда)
//2015.12.18

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если клНетДа("Очистить цены во всех строках?") Тогда Возврат КонецЕсли;
	
	Для Каждого Стр Из Объект.Товары Цикл
		Стр.ЦенаЗакупки = 0;
	КонецЦикла; 
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
//2015.12.18

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	МоиИтоги();
	Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если клНетДа("Заполнить цены (последние приходы от " + гоИмя(Объект.Контрагент) + ") во всех строках?") Тогда Возврат КонецЕсли;
	ИскатьБез = клДаНет("Искать цену другого поставщика, если не было прихода от " + гоИмя(Объект.Контрагент) + "?");
	
	Для Каждого Стр Из Объект.Товары Цикл
		ВернутьЦену = 0;
		ВернутьВалюту = 0;
		ВернутьДату = 0;
		омСервер.ПоследняяЦенаЗакупки(Стр.Номенклатура, Объект.Фирма, Объект.Контрагент, ВернутьЦену, ВернутьВалюту, ВернутьДату, Объект.Валюта);
		
		Если (ВернутьЦену = 0) И ИскатьБез Тогда
			ВернутьЦену = 0;
			ВернутьВалюту = 0;
			ВернутьДату = 0;
			омСервер.ПоследняяЦенаЗакупки(Стр.Номенклатура, Объект.Фирма, 0, ВернутьЦену, ВернутьВалюту, ВернутьДату, Объект.Валюта);
		КонецЕсли; 
		
		Стр.ЦенаЗакупки = ВернутьЦену;
	КонецЦикла; 
	
	МояЗаписать(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИскатьКонтрагента(Команда)
//2016.06.09

	НовКон = клИскатьКонтрагента(Объект.Контрагент);
	Если НовКон = Неопределено Тогда Возврат КонецЕсли; 
	Объект.Контрагент = новКон;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
